In [1]:
import pandas as pd

In [2]:
# Dataframe
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 1. Display Top 3 Rows of The Dataset

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

### 2. Check Last 3 Rows of The Dataset

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 3. Find Shape of Our Dataset (Numbers of Rows & Numbers of Columns)

In [5]:
# Cách 1: Phổ biến
df1.shape

(7, 3)

In [6]:
print("Number of Rows:", df1.shape[0])
print("Number of Columns:",df1.shape[1])

Number of Rows: 7
Number of Columns: 3

### 4. Get Information About Our Dataset Like Total Numbers Rows, Total Numbers of Columns, Datatypes of Each Column And Memory Requirement

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

### 5. Check Null Values In The Dataset

In [8]:
df1.isnull() # trả về các kiểu boolean tại mỗi giá trị hàng cột

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df1.isnull().sum()  # Đếm xem mỗi cột có bao nhiêu giá trị null --> mặc định axis = 0

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.isnull().sum(axis = 1)  # Đếm xem mỗi hàng có bao nhiêu giá trị null

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

### 6. Get Overall Statistics About The Dataframe

In [11]:
df1.describe()   # thg chỉ xét các cột có dtype là loại số

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [12]:
df1.describe(include = 'all') # xét tất cả các cột

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

### 7. Find Unique Values From The Gender Column

In [13]:
df1['Gender'].unique()  # Trả về 1 mảng các giá trị duy nhất

array(['Male', 'Female'], dtype=object)

### 8. Find the Number of Unique values from the Gender column

In [14]:
df1['Gender'].nunique()  # Trả về số lượng giá trị duy nhất trong cột

2

### 9. Display Count of Unique Values In Gender Column

In [15]:
df1['Gender'].value_counts()   # Số lượng giá trị (số lần xh) cho mỗi giá trị duy nhất trên cột

Gender
Female    4
Male      3
Name: count, dtype: int64

### 10. Find Total Number of Student Having Marks Between 90 To 100 (Inclusive) Using Between Method

In [16]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])  # Viết đk và tính độ dài

4

In [17]:
df1['Marks'].between(90,100).sum()  # s/d method between() --> Trả về kiểu Boolean --> tính Sum các gtri True

4

### 11. Find Average Marks

In [18]:
df1['Marks'].mean()

92.14285714285714

### 12. **`Apply`** Method

In [19]:
# function
def marks(x):
    return x/2

df1['Marks'].apply(marks)   # Phương thức apply s/d fuction ta xd

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [20]:
df1['Marks'].apply(lambda x:x/2)    # Phương thức apply s/d lambda

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [21]:
df1['Name'].apply(len)   # Phương thức apply s/d function có sẵn

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### 13. **`Map`** Function

In [22]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [23]:
# Thay đổi giá trị mong muốn
df1['Gender'].map({'Male':1, 'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

### 14. Drop the Column(s)

In [24]:
df1['Male_Female'] = df1['Gender'].map({'Male':1, 'Female':0})   # --> Tạo 1 cột

In [25]:
df1

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [26]:
df1.drop('Male_Female', axis = 1, inplace = True)

In [27]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### 15. Print Name of the Columns

In [28]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [29]:
df1.index

RangeIndex(start=0, stop=7, step=1)

### 16. Sort The DataFrames As Per The Marks Column

In [30]:
df1.sort_values(by = 'Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

### 17. Display Name & Marks of The Female Students

In [31]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [32]:
# Cách 1:
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [33]:
# Cách 2:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99